#encoding:utf-8
__author__ = 'binpo'
#--订单的状态
ORDER_STAYUS={
    1:'生成订单',
    2:'完成订单',
    3:'取消订单',
    4:'作废订单'
}
PAY_STATUS={
    0:'未付款',
    1:'已付款',
    2:'申请退款',
    3:'已退款'
}
#-----支付表单的状态------
PAYMENT_STATUS={
    0:'等待支付',
    1:'支付成功',
    2:'取消支付'
}

# 发货单和退货单的转改
REFUND_STATUS={
    0:'申请退款',
    1:'不予退款',
    2:'已受理退款',
    3:'退款成功'
}

DELIVERRY_STATUS = {
    0:'未发货',
    1:'已发货',
    2:'已签收' ,
    3:'申请退货',
    4:'已退货'
}
# 支付方式
PAY_TYPE = {
    0:'',
    7:'通联支付',
    8:'易宝支付',
    6:'微信支付',
    9:'支付宝'
}
ORDER_TYPE={
    1:'普通订单',
    2:'优惠订单',
    3:'团购订单'
}

ORDER_STATUS_REMARK={
    '100':'订单提交成功',
    '110':'订单支付成功，等待海关清关',
    '212':'订单签收完成',
    '111':'包裹已发出',
    '223':'订单申请退货退款',
    '300':'订单取消订单',
    '400':'订单已作废'
    # '300':'',
    # '400':''
}


