#encoding:utf-8
'''
Created on 2014-5-31

@author: qiuyan.zwp
'''
PAGE_COUNT=[25,50,100,200]

OSS_ACCESS_ID=''
OSS_ACCESS_KEY=''

#发送短信接口返回状态
SMS_STATUS = {
    -10:'验证信息失败	检查api key是否和各种中心内的一致，调用传入是否正确',
    -20: '短信余额不足	进入个人中心购买充值',
    -30: '短信内容为空	检查调用传入参数：message',
    -31: '短信内容存在敏感词	修改短信内容，更换词语',
    -32: '短信内容缺少签名信息	短信内容末尾增加签名信息eg.【公司名称】',
    -40:'错误的手机号	检查手机号是否正确',
    -41:'号码在黑名单中	号码因频繁发送或其他原因暂停发送，请联系客服确认',
    -42: '验证码类短信发送频率过快',
}


LOGIN_CODE_TEMPLATE = '你的注册验证码为[{0}],请不要泄露给任何人,欢迎来到全球抢购,抢遍全球【全球抢购】'

ORDER_SENDED_TEMPLATE = '你好,您在全球抢购的商品已发货,本次运费由全球抢购全额补贴哦! 快递单号({0}):{1}【全球抢购】'
